In [2]:
import pandas as pd

In [3]:
Data=pd.read_excel("Groups.xlsx")
Data

   Group A  Group B  Group C
0       23       19       14
1       21       21       13
2       19       25       31
3       23       29       23
4       23       28       26
5       22       30       29
6       26       24       21

In [4]:
Data.head()

   Group A  Group B  Group C
0       23       19       14
1       21       21       13
2       19       25       31
3       23       29       23
4       23       28       26

In [5]:
Data.head(2)

   Group A  Group B  Group C
0       23       19       14
1       21       21       13

In [6]:
Data.tail(3)

   Group A  Group B  Group C
4       23       28       26
5       22       30       29
6       26       24       21

In [7]:
Data.shape

(7, 3)

In [8]:
Data.columns

Index(['Group A', 'Group B', 'Group C'], dtype='object')

In [9]:
Data.dtypes

Group A    int64
Group B    int64
Group C    int64
dtype: object

In [10]:
Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Group A  7 non-null      int64
 1   Group B  7 non-null      int64
 2   Group C  7 non-null      int64
dtypes: int64(3)
memory usage: 296.0 bytes

In [11]:
Data['Group A']

0    23
1    21
2    19
3    23
4    23
5    22
6    26
Name: Group A, dtype: int64

In [12]:
Data[['Group A']]

   Group A
0       23
1       21
2       19
3       23
4       23
5       22
6       26

In [13]:
Data.sample(2)

   Group A  Group B  Group C
4       23       28       26
2       19       25       31

In [14]:
Data.sample(2)

   Group A  Group B  Group C
2       19       25       31
5       22       30       29

In [15]:
Data.sample(3)

   Group A  Group B  Group C
2       19       25       31
0       23       19       14
1       21       21       13

In [16]:
Data[['Group A']].head(2)

   Group A
0       23
1       21

In [17]:
Data[['Group C']].tail(2)

   Group C
5       29
6       21

In [18]:
Data[2:7]

   Group A  Group B  Group C
2       19       25       31
3       23       29       23
4       23       28       26
5       22       30       29
6       26       24       21

In [19]:
Data[2:5]

   Group A  Group B  Group C
2       19       25       31
3       23       29       23
4       23       28       26

In [20]:
Data[-2:]

   Group A  Group B  Group C
5       22       30       29
6       26       24       21

In [21]:
Data[-3:]

   Group A  Group B  Group C
4       23       28       26
5       22       30       29
6       26       24       21